#!/usr/bin/env bash

while ! nc -z $POSTGRES_HOST $POSTGRES_PORT; do
      sleep 0.1
done 

alembic upgrade head

cat > data.sql <<EOF
-- Insert data into advertisement table
INSERT INTO advertisement (title, author, views, position, id) VALUES
('Установка, монтаж и настройка систем видеонаблюдения во Владивостоке', 'Сервис.Про', 1008, 1, '03e857a7-2c12-42b5-aa19-9a4731c17b2d'),
('Установка Видеонаблюдение шлагбаум сигнализация обслуживание домофон во Владивостоке', '100 камер', 557, 2, '594c0d8c-1e67-4cf4-bc3d-9270ca08e7e6'),
('Ремонт/Настройка видеонаблюдения: камер, регистраторов, домофонов. И т. д во Владивостоке', 'GM1022', 298, 3, '02c61d88-32de-4c31-adb7-152aa262b102'),
('Установка видеонаблюдения и видеокамер в домах во Владивостоке', 'ООО "Тесла"', 1746, 4, '88f2950d-ac55-41cc-a8a7-57775d10ca8c'),
('Монтаж и обслуживание систем видеонаблюдения, СКУД, домофоны во Владивостоке', 'Videofort', 362, 5, 'c77c1848-6769-4de7-acc3-b773c6e3bc7b'),
('Монтаж видеонаблюдения Hikvision HiWatch Trassir, СКУД, домофонов во Владивостоке', 'doneit', 449, 6, '8edca599-8a4f-4701-825d-25088938df4e'),
('Видеонаблюдение Установка Продажа Настройка Видеокамер IP во Владивостоке', 'TVi MART', 1416, 7, '948f04b8-9903-46e7-aa0f-670c1d8f67e5'),
('ВидеоКИТ - Системы видеонаблюдения, установка, обслуживание во Владивостоке', 'VideoKIT', 133, 8, '467a2cb9-c59e-4563-96bc-d1430a770d82'),
('Установка, монтаж систем видеонаблюдения установка камер во Владивостоке', 'Den2078', 2553, 9, '21199485-b692-4d9e-965d-3055431b8226'),
('Установим Видеодомофон в квартиру или частный дом! Видеонаблюдение во Владивостоке', 'Подряд', 87, 10, 'af11403b-3ee9-4fd8-a3a2-c2072c701a4b');
EOF

# Execute the SQL script
export PGPASSWORD=$POSTGRES_PASSWORD
psql -h $POSTGRES_HOST -p $POSTGRES_PORT -U $POSTGRES_USER -d $POSTGRES_DB < data.sql



gunicorn main:app --bind 0.0.0.0:8000 --workers 3 -k uvicorn.workers.UvicornWorker